In [18]:
datos_ejemplo = {"Nombre": ["Agustina", "Diana", "Karen", "Julián", "Emilio", "Miguel", "Mateo", "Laura", "Jorge", "Lucas"], "Puntaje": [12.5, 9, 16.5, 13, 9, 20, 14.5, 10, 8, 19], "Intentos": [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], "Califica": [1, 0, 1, 0, 0, 1, 1, 0, 0, 1]}

labels = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"]

In [19]:
import pandas as pd
df= pd.DataFrame(data = datos_ejemplo, index = labels)
df

     Nombre  Puntaje  Intentos  Califica
a  Agustina     12.5         1         1
b     Diana      9.0         3         0
c     Karen     16.5         2         1
d    Julián     13.0         3         0
e    Emilio      9.0         2         0
f    Miguel     20.0         3         1
g     Mateo     14.5         1         1
h     Laura     10.0         1         0
i     Jorge      8.0         2         0
j     Lucas     19.0         1         1

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    10 non-null     object
 1   Puntaje   10 non-null     float64
 2   Intentos  10 non-null     int64
 3   Califica  10 non-null     int64
dtypes: float64(1), int64(2), object(1)
memory usage: 400.0+ bytes

In [21]:
df.head(3)

     Nombre  Puntaje  Intentos  Califica
a  Agustina     12.5         1         1
b     Diana      9.0         3         0
c     Karen     16.5         2         1

In [22]:
df[['Nombre','Puntaje']]

     Nombre  Puntaje
a  Agustina     12.5
b     Diana      9.0
c     Karen     16.5
d    Julián     13.0
e    Emilio      9.0
f    Miguel     20.0
g     Mateo     14.5
h     Laura     10.0
i     Jorge      8.0
j     Lucas     19.0

In [23]:
nombres = []
long = []
dic={}
for i in df.Nombre.tolist():
    nombres.append(str.upper(i))
    long.append(len(i))
dic['Nombre']=nombres
dic['Long']= long

In [24]:
df.Nombre.tolist()

['Agustina',
 'Diana',
 'Karen',
 'Julián',
 'Emilio',
 'Miguel',
 'Mateo',
 'Laura',
 'Jorge',
 'Lucas']

In [25]:
personas= pd.DataFrame(data = dic, index = labels)
personas

     Nombre  Long
a  AGUSTINA     8
b     DIANA     5
c     KAREN     5
d    JULIÁN     6
e    EMILIO     6
f    MIGUEL     6
g     MATEO     5
h     LAURA     5
i     JORGE     5
j     LUCAS     5